In [ ]:
# First check out the merge function in the pandas library

In [ ]:
# pandas.merge(left, right, how='inner', on=None, left_on=None, right_on=None, left_index=False,
# right_index=False, sort=False, suffixes=('_x', '_y'), copy=True, indicator=False, validate=None)[source]
# Merge DataFrame or named Series objects with a database-style join.

# The join is done on columns or indexes. If joining columns on columns, the DataFrame indexes will be ignored. 
# Otherwise if joining indexes on indexes or indexes on a column or columns, the index will be passed on.

In [2]:
# Lets create two dataframes
import pandas as pd
df1= pd.DataFrame({
    "city": ["New York", "Los Angelas", "San Diego"],  # Column city is the key( "city"):value ("new york"...) in a list 
    "Temperature" :["87","98","85"]
})
df1

          city Temperature
0     New York          87
1  Los Angelas          98
2    San Diego          85

In [9]:
d ={ "city": ["New York", "San Francisco", " San Jose", "Miami"],
        "Humidity": ["50", "45", "35", " 40"]
      }
df2=pd.DataFrame(data = d)
df2

            city Humidity
0       New York       50
1  San Francisco       45
2       San Jose       35
3          Miami       40

In [13]:
# Now we use pd.merge() to merge two dataframes df1 and df2
# Intersection: how="inner"
#df3=pd.merge(df1,df2, on="city")
# how= "inner" join = "intersetion join" is defalted left =df1, right=df2 dataframes located on the left and right
# on the column "city"
df3=pd.merge(df1, df2, on ="city")
df3

# Only

       city Temperature Humidity
0  New York          87       50

In [15]:
# dataframens joint will be a Union  : how= " outer"
df4= pd.merge(df1,df2, how="outer")
df4

            city Temperature Humidity
0       New York          87       50
1    Los Angelas          98      NaN
2      San Diego          85      NaN
3  San Francisco         NaN       45
4       San Jose         NaN       35
5          Miami         NaN       40

In [16]:
# how ="left" joint with left =df1
df5=pd.merge(df1,df2, how="left")  # All datas join to the df1
df5

          city Temperature Humidity
0     New York          87       50
1  Los Angelas          98      NaN
2    San Diego          85      NaN

In [17]:
df6=pd.merge(df1,df2, how="right")  # all data merge to df2
df6

            city Temperature Humidity
0       New York          87       50
1  San Francisco         NaN       45
2       San Jose         NaN       35
3          Miami         NaN       40

In [19]:
# how = " outer " and indicator=True
df4=pd.merge(df1,df2,how="outer", indicator=True)
df4

            city Temperature Humidity      _merge
0       New York          87       50        both
1    Los Angelas          98      NaN   left_only
2      San Diego          85      NaN   left_only
3  San Francisco         NaN       45  right_only
4       San Jose         NaN       35  right_only
5          Miami         NaN       40  right_only

In [26]:
# With surfices if both dataframes as the same columns
df7=pd.merge(df5,df6, on="city" ,suffixes=('_left' , '_right'))
df7

       city Temperature_left Humidity_left Temperature_right Humidity_right
0  New York               87            50                87             50

In [12]:
# class pandas.DataFrame(data=None, index=None, columns=None, dtype=None, copy=False)[source]

In [28]:
df=pd.DataFrame({
   "John" :["938477566"] ,
"Jack" : ["938377264"],
   "Jill" :["947662781" ]
})
df

        John       Jack       Jill
0  938477566  938377264  947662781